Ran Plan for 5 projects:

1. dir: `nz3es/gcp/stg/data-plane/iac-01/global/dns-zone/iac-com` workspace: `nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com`
1. dir: `nz3es/gcp/stg/data-plane/iac-01/global/network` workspace: `nz3es_gcp_stg_data-plane_iac-01_global_network`
1. dir: `nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/memorystore/volatile-lru` workspace: `nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_memorystore_volatile-lru`
1. dir: `nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/secret/volatile-lru-ca-cert` workspace: `nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_secret_volatile-lru-ca-cert`
1. dir: `nz3es/gcp/stg/data-plane/iac-01/global/dns-zone/iac-internal` workspace: `nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-internal`
---

### 1. dir: `nz3es/gcp/stg/data-plane/iac-01/global/dns-zone/iac-com` workspace: `nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com`
<details><summary>Show Output</summary>

```diff
Removing TG cache from /home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com...
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/dns-zone/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/dns-zone/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/dns-zone/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/memorystore-valkey/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/memorystore-valkey/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/memorystore-valkey/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/vpc/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/vpc/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/vpc/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/secret-manager/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/secret-manager/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/secret-manager/variables.tf

20:32:30.263 WARN   The following strict control(s) are already completed: skip-dependencies-inputs. Please remove any completed strict controls, as setting them no longer does anything. For a list of all ongoing strict controls, and the outcomes of previous strict controls, see https://terragrunt.gruntwork.io/docs/reference/strict-mode or get the actual list by running the `terragrunt info strict` command.
20:32:30.982 INFO   Downloading Terraform configurations from ../../../../../../../../modules/dns-zone into ./.terragrunt-cache/63uf0Dg6fY0pFHv-sEemvygovhA/v6wJs2a6MLjRmaL6QlkyT8uyUEE
20:32:31.160 INFO   terraform1.13.3: Initializing the backend...
20:32:32.150 INFO   terraform1.13.3: 
20:32:32.150 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
20:32:32.150 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
20:32:32.451 INFO   terraform1.13.3: Initializing provider plugins...
20:32:32.451 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 6.0.0"...
20:32:33.625 INFO   terraform1.13.3: - Installing hashicorp/google v7.17.0...
20:32:38.838 INFO   terraform1.13.3: - Installed hashicorp/google v7.17.0 (signed by HashiCorp)
20:32:38.838 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
20:32:38.838 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
20:32:38.838 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
20:32:38.838 INFO   terraform1.13.3: you run "terraform init" in the future.
20:32:38.838 INFO   terraform1.13.3: Terraform has been successfully initialized!
20:32:44.252 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
20:32:44.253 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
20:32:44.253 STDOUT terraform1.13.3:   + create
20:32:44.253 STDOUT terraform1.13.3: Terraform will perform the following actions:
20:32:44.253 STDOUT terraform1.13.3:   # google_dns_managed_zone.zone will be created
20:32:44.253 STDOUT terraform1.13.3:   + resource "google_dns_managed_zone" "zone" {
20:32:44.253 STDOUT terraform1.13.3:       + creation_time    = (known after apply)
20:32:44.253 STDOUT terraform1.13.3:       + description      = "Public DNS zone for stg"
20:32:44.253 STDOUT terraform1.13.3:       + dns_name         = "iac.com."
20:32:44.254 STDOUT terraform1.13.3:       + effective_labels = {
20:32:44.254 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
20:32:44.254 STDOUT terraform1.13.3:         }
20:32:44.254 STDOUT terraform1.13.3:       + force_destroy    = false
20:32:44.254 STDOUT terraform1.13.3:       + id               = (known after apply)
20:32:44.254 STDOUT terraform1.13.3:       + managed_zone_id  = (known after apply)
20:32:44.254 STDOUT terraform1.13.3:       + name             = "iac-com"
20:32:44.254 STDOUT terraform1.13.3:       + name_servers     = (known after apply)
20:32:44.255 STDOUT terraform1.13.3:       + project          = "iac-01"
20:32:44.255 STDOUT terraform1.13.3:       + terraform_labels = {
20:32:44.255 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
20:32:44.255 STDOUT terraform1.13.3:         }
20:32:44.255 STDOUT terraform1.13.3:       + visibility       = "public"
20:32:44.255 STDOUT terraform1.13.3:       + cloud_logging_config (known after apply)
20:32:44.255 STDOUT terraform1.13.3:       + dnssec_config (known after apply)
20:32:44.255 STDOUT terraform1.13.3:     }
20:32:44.255 STDOUT terraform1.13.3: Plan: 1 to add, 0 to change, 0 to destroy.
20:32:44.255 STDOUT terraform1.13.3: 
20:32:44.255 STDOUT terraform1.13.3: Changes to Outputs:
20:32:44.255 STDOUT terraform1.13.3:   + dns_name     = "iac.com."
20:32:44.255 STDOUT terraform1.13.3:   + name_servers = (known after apply)
20:32:44.256 STDOUT terraform1.13.3:   + zone_name    = "iac-com"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d nz3es/gcp/stg/data-plane/iac-01/global/dns-zone/iac-com -w nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://www.3es.nz/lock?id=esquare666%252Finfra-as-code%252Fnz3es%252Fgcp%252Fstg%252Fdata-plane%252Fiac-01%252Fglobal%252Fdns-zone%252Fiac-com%252Fnz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d nz3es/gcp/stg/data-plane/iac-01/global/dns-zone/iac-com -w nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `nz3es/gcp/stg/data-plane/iac-01/global/network` workspace: `nz3es_gcp_stg_data-plane_iac-01_global_network`
<details><summary>Show Output</summary>

```diff
Removing TG cache from /home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_network...
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_network/modules/dns-zone/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_network/modules/dns-zone/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_network/modules/dns-zone/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_network/modules/memorystore-valkey/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_network/modules/memorystore-valkey/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_network/modules/memorystore-valkey/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_network/modules/vpc/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_network/modules/vpc/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_network/modules/vpc/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_network/modules/secret-manager/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_network/modules/secret-manager/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_network/modules/secret-manager/variables.tf

20:32:30.266 WARN   The following strict control(s) are already completed: skip-dependencies-inputs. Please remove any completed strict controls, as setting them no longer does anything. For a list of all ongoing strict controls, and the outcomes of previous strict controls, see https://terragrunt.gruntwork.io/docs/reference/strict-mode or get the actual list by running the `terragrunt info strict` command.
20:32:30.958 INFO   Downloading Terraform configurations from ../../../../../../../modules/vpc into ./.terragrunt-cache/fOWfWgGbl0lMBBXxfWIloltD5XY/N7tP5F9UZBKrMAEPjqQ3fvlOQXg
20:32:31.157 INFO   terraform1.13.3: Initializing the backend...
20:32:32.060 INFO   terraform1.13.3: 
20:32:32.060 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
20:32:32.060 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
20:32:32.363 INFO   terraform1.13.3: Initializing provider plugins...
20:32:32.363 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 6.0.0"...
20:32:33.627 INFO   terraform1.13.3: - Installing hashicorp/google v7.17.0...
20:32:38.805 INFO   terraform1.13.3: - Installed hashicorp/google v7.17.0 (signed by HashiCorp)
20:32:38.805 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
20:32:38.805 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
20:32:38.805 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
20:32:38.805 INFO   terraform1.13.3: you run "terraform init" in the future.
20:32:38.805 INFO   terraform1.13.3: Terraform has been successfully initialized!
20:32:44.142 STDOUT terraform1.13.3: google_compute_network.vpc_network: Refreshing state... [id=projects/iac-01/global/networks/stg-iac-01]
20:32:45.095 STDOUT terraform1.13.3: google_compute_subnetwork.subnets["ause2"]: Refreshing state... [id=projects/iac-01/regions/australia-southeast2/subnetworks/ause2]
20:32:45.095 STDOUT terraform1.13.3: google_compute_subnetwork.subnets["ause1"]: Refreshing state... [id=projects/iac-01/regions/australia-southeast1/subnetworks/ause1]
20:32:45.932 STDOUT terraform1.13.3: No changes. Your infrastructure matches the configuration.
20:32:45.932 STDOUT terraform1.13.3: Terraform has compared your real infrastructure against your configuration
20:32:45.932 STDOUT terraform1.13.3: and found no differences, so no changes are needed.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d nz3es/gcp/stg/data-plane/iac-01/global/network -w nz3es_gcp_stg_data-plane_iac-01_global_network
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://www.3es.nz/lock?id=esquare666%252Finfra-as-code%252Fnz3es%252Fgcp%252Fstg%252Fdata-plane%252Fiac-01%252Fglobal%252Fnetwork%252Fnz3es_gcp_stg_data-plane_iac-01_global_network)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d nz3es/gcp/stg/data-plane/iac-01/global/network -w nz3es_gcp_stg_data-plane_iac-01_global_network
  ```
No changes. Your infrastructure matches the configuration.

---
### 3. dir: `nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/memorystore/volatile-lru` workspace: `nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_memorystore_volatile-lru`
<details><summary>Show Output</summary>

```diff
Removing TG cache from /home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_memorystore_volatile-lru...
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_memorystore_volatile-lru/modules/dns-zone/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_memorystore_volatile-lru/modules/dns-zone/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_memorystore_volatile-lru/modules/dns-zone/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_memorystore_volatile-lru/modules/memorystore-valkey/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_memorystore_volatile-lru/modules/memorystore-valkey/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_memorystore_volatile-lru/modules/memorystore-valkey/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_memorystore_volatile-lru/modules/vpc/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_memorystore_volatile-lru/modules/vpc/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_memorystore_volatile-lru/modules/vpc/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_memorystore_volatile-lru/modules/secret-manager/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_memorystore_volatile-lru/modules/secret-manager/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_memorystore_volatile-lru/modules/secret-manager/variables.tf

20:32:30.264 WARN   The following strict control(s) are already completed: skip-dependencies-inputs. Please remove any completed strict controls, as setting them no longer does anything. For a list of all ongoing strict controls, and the outcomes of previous strict controls, see https://terragrunt.gruntwork.io/docs/reference/strict-mode or get the actual list by running the `terragrunt info strict` command.
20:32:30.971 INFO   Downloading Terraform configurations from ../../../../../../../../modules/memorystore-valkey into ./.terragrunt-cache/hk1yA_EOSim_kHwCn8l_U-OTTew/h1Dmay-GfWSmudIvkr-rnWKou-c
20:32:31.163 INFO   terraform1.13.3: Initializing the backend...
20:32:32.123 INFO   terraform1.13.3: 
20:32:32.124 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
20:32:32.124 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
20:32:32.441 INFO   terraform1.13.3: Initializing modules...
20:32:32.963 INFO   terraform1.13.3: Downloading registry.terraform.io/terraform-google-modules/memorystore/google 16.0.0 for valkey...
20:32:34.775 INFO   terraform1.13.3: - valkey in .terraform/modules/valkey/modules/valkey
20:32:35.031 INFO   terraform1.13.3: Downloading registry.terraform.io/terraform-google-modules/project-factory/google 18.2.0 for valkey.enable_apis...
20:32:37.543 INFO   terraform1.13.3: - valkey.enable_apis in .terraform/modules/valkey.enable_apis/modules/project_services
20:32:37.545 INFO   terraform1.13.3: Initializing provider plugins...
20:32:37.545 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 3.43.0, >= 6.0.0, >= 7.13.0, < 8.0.0"...
20:32:37.703 INFO   terraform1.13.3: - Finding hashicorp/google-beta versions matching ">= 3.43.0, < 8.0.0"...
20:32:38.020 INFO   terraform1.13.3: - Using hashicorp/google v7.17.0 from the shared cache directory
20:32:39.157 INFO   terraform1.13.3: - Installing hashicorp/google-beta v7.17.0...
20:32:43.135 INFO   terraform1.13.3: - Installed hashicorp/google-beta v7.17.0 (signed by HashiCorp)
20:32:43.135 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
20:32:43.135 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
20:32:43.135 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
20:32:43.135 INFO   terraform1.13.3: you run "terraform init" in the future.
20:32:43.136 INFO   terraform1.13.3: ╷
20:32:43.137 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
20:32:43.137 INFO   terraform1.13.3: │ 
20:32:43.137 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
20:32:43.137 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
20:32:43.137 INFO   terraform1.13.3: │   - hashicorp/google
20:32:43.137 INFO   terraform1.13.3: │ 
20:32:43.137 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
20:32:43.137 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
20:32:43.137 INFO   terraform1.13.3: │ these providers.
20:32:43.137 INFO   terraform1.13.3: │ 
20:32:43.137 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
20:32:43.138 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
20:32:43.138 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
20:32:43.138 INFO   terraform1.13.3: ╵
20:32:43.138 INFO   terraform1.13.3: Terraform has been successfully initialized!
20:32:47.821 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
20:32:47.821 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
20:32:47.821 STDOUT terraform1.13.3:   + create
20:32:47.821 STDOUT terraform1.13.3: Terraform will perform the following actions:
20:32:47.822 STDOUT terraform1.13.3:   # module.valkey.google_memorystore_instance.valkey_cluster will be created
20:32:47.822 STDOUT terraform1.13.3:   + resource "google_memorystore_instance" "valkey_cluster" {
20:32:47.822 STDOUT terraform1.13.3:       + authorization_mode             = "IAM_AUTH"
20:32:47.822 STDOUT terraform1.13.3:       + available_maintenance_versions = (known after apply)
20:32:47.822 STDOUT terraform1.13.3:       + backup_collection              = (known after apply)
20:32:47.822 STDOUT terraform1.13.3:       + create_time                    = (known after apply)
20:32:47.823 STDOUT terraform1.13.3:       + deletion_protection_enabled    = false
20:32:47.823 STDOUT terraform1.13.3:       + discovery_endpoints            = (known after apply)
20:32:47.823 STDOUT terraform1.13.3:       + effective_labels               = {
20:32:47.823 STDOUT terraform1.13.3:           + "component"                  = "memorystore"
20:32:47.824 STDOUT terraform1.13.3:           + "environment"                = "stg"
20:32:47.824 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
20:32:47.824 STDOUT terraform1.13.3:           + "managed_by"                 = "atlantis"
20:32:47.824 STDOUT terraform1.13.3:           + "org"                        = "nz3es"
20:32:47.824 STDOUT terraform1.13.3:           + "plane"                      = "data-plane"
20:32:47.825 STDOUT terraform1.13.3:           + "project"                    = "iac-01"
20:32:47.825 STDOUT terraform1.13.3:           + "region"                     = "australia-southeast2"
20:32:47.825 STDOUT terraform1.13.3:         }
20:32:47.825 STDOUT terraform1.13.3:       + effective_maintenance_version  = (known after apply)
20:32:47.825 STDOUT terraform1.13.3:       + endpoints                      = (known after apply)
20:32:47.826 STDOUT terraform1.13.3:       + engine_configs                 = {
20:32:47.826 STDOUT terraform1.13.3:           + "maxmemory-policy" = "volatile-lru"
20:32:47.826 STDOUT terraform1.13.3:         }
20:32:47.826 STDOUT terraform1.13.3:       + engine_version                 = "VALKEY_8_0"
20:32:47.826 STDOUT terraform1.13.3:       + id                             = (known after apply)
20:32:47.826 STDOUT terraform1.13.3:       + instance_id                    = "volatile-lru"
20:32:47.826 STDOUT terraform1.13.3:       + labels                         = {
20:32:47.827 STDOUT terraform1.13.3:           + "component"   = "memorystore"
20:32:47.827 STDOUT terraform1.13.3:           + "environment" = "stg"
20:32:47.827 STDOUT terraform1.13.3:           + "managed_by"  = "atlantis"
20:32:47.827 STDOUT terraform1.13.3:           + "org"         = "nz3es"
20:32:47.827 STDOUT terraform1.13.3:           + "plane"       = "data-plane"
20:32:47.827 STDOUT terraform1.13.3:           + "project"     = "iac-01"
20:32:47.827 STDOUT terraform1.13.3:           + "region"      = "australia-southeast2"
20:32:47.827 STDOUT terraform1.13.3:         }
20:32:47.827 STDOUT terraform1.13.3:       + location                       = "australia-southeast2"
20:32:47.828 STDOUT terraform1.13.3:       + maintenance_schedule           = (known after apply)
20:32:47.828 STDOUT terraform1.13.3:       + managed_server_ca              = (known after apply)
20:32:47.828 STDOUT terraform1.13.3:       + mode                           = (known after apply)
20:32:47.828 STDOUT terraform1.13.3:       + name                           = (known after apply)
20:32:47.828 STDOUT terraform1.13.3:       + node_config                    = (known after apply)
20:32:47.828 STDOUT terraform1.13.3:       + node_type                      = "SHARED_CORE_NANO"
20:32:47.828 STDOUT terraform1.13.3:       + project                        = "iac-01"
20:32:47.828 STDOUT terraform1.13.3:       + psc_attachment_details         = (known after apply)
20:32:47.829 STDOUT terraform1.13.3:       + psc_auto_connections           = (known after apply)
20:32:47.829 STDOUT terraform1.13.3:       + replica_count                  = 0
20:32:47.829 STDOUT terraform1.13.3:       + shard_count                    = 1
20:32:47.829 STDOUT terraform1.13.3:       + state                          = (known after apply)
20:32:47.829 STDOUT terraform1.13.3:       + state_info                     = (known after apply)
20:32:47.830 STDOUT terraform1.13.3:       + terraform_labels               = {
20:32:47.830 STDOUT terraform1.13.3:           + "component"                  = "memorystore"
20:32:47.830 STDOUT terraform1.13.3:           + "environment"                = "stg"
20:32:47.830 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
20:32:47.830 STDOUT terraform1.13.3:           + "managed_by"                 = "atlantis"
20:32:47.830 STDOUT terraform1.13.3:           + "org"                        = "nz3es"
20:32:47.830 STDOUT terraform1.13.3:           + "plane"                      = "data-plane"
20:32:47.831 STDOUT terraform1.13.3:           + "project"                    = "iac-01"
20:32:47.831 STDOUT terraform1.13.3:           + "region"                     = "australia-southeast2"
20:32:47.831 STDOUT terraform1.13.3:         }
20:32:47.831 STDOUT terraform1.13.3:       + transit_encryption_mode        = "SERVER_AUTHENTICATION"
20:32:47.831 STDOUT terraform1.13.3:       + uid                            = (known after apply)
20:32:47.831 STDOUT terraform1.13.3:       + update_time                    = (known after apply)
20:32:47.831 STDOUT terraform1.13.3:       + cross_instance_replication_config (known after apply)
20:32:47.831 STDOUT terraform1.13.3:       + desired_psc_auto_connections {
20:32:47.832 STDOUT terraform1.13.3:           + network    = "projects/iac-01/global/networks/stg-iac-01"
20:32:47.832 STDOUT terraform1.13.3:           + project_id = "iac-01"
20:32:47.832 STDOUT terraform1.13.3:         }
20:32:47.832 STDOUT terraform1.13.3:       + persistence_config {
20:32:47.832 STDOUT terraform1.13.3:           + mode = (known after apply)
20:32:47.832 STDOUT terraform1.13.3:           + aof_config (known after apply)
20:32:47.832 STDOUT terraform1.13.3:           + rdb_config (known after apply)
20:32:47.832 STDOUT terraform1.13.3:         }
20:32:47.832 STDOUT terraform1.13.3:       + zone_distribution_config {
20:32:47.832 STDOUT terraform1.13.3:           + mode = "MULTI_ZONE"
20:32:47.833 STDOUT terraform1.13.3:         }
20:32:47.833 STDOUT terraform1.13.3:     }
20:32:47.833 STDOUT terraform1.13.3:   # module.valkey.google_network_connectivity_service_connection_policy.service_connection_policies["valkey-psc"] will be created
20:32:47.833 STDOUT terraform1.13.3:   + resource "google_network_connectivity_service_connection_policy" "service_connection_policies" {
20:32:47.833 STDOUT terraform1.13.3:       + create_time      = (known after apply)
20:32:47.833 STDOUT terraform1.13.3:       + effective_labels = {
20:32:47.833 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
20:32:47.834 STDOUT terraform1.13.3:         }
20:32:47.834 STDOUT terraform1.13.3:       + etag             = (known after apply)
20:32:47.834 STDOUT terraform1.13.3:       + id               = (known after apply)
20:32:47.834 STDOUT terraform1.13.3:       + infrastructure   = (known after apply)
20:32:47.834 STDOUT terraform1.13.3:       + location         = "australia-southeast2"
20:32:47.834 STDOUT terraform1.13.3:       + name             = "valkey-psc"
20:32:47.834 STDOUT terraform1.13.3:       + network          = "projects/iac-01/global/networks/stg-iac-01"
20:32:47.834 STDOUT terraform1.13.3:       + project          = "iac-01"
20:32:47.834 STDOUT terraform1.13.3:       + psc_connections  = (known after apply)
20:32:47.835 STDOUT terraform1.13.3:       + service_class    = "gcp-memorystore"
20:32:47.835 STDOUT terraform1.13.3:       + terraform_labels = {
20:32:47.835 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
20:32:47.835 STDOUT terraform1.13.3:         }
20:32:47.835 STDOUT terraform1.13.3:       + update_time      = (known after apply)
20:32:47.835 STDOUT terraform1.13.3:       + psc_config {
20:32:47.835 STDOUT terraform1.13.3:           + producer_instance_location = (known after apply)
20:32:47.835 STDOUT terraform1.13.3:           + subnetworks                = [
20:32:47.836 STDOUT terraform1.13.3:               + "projects/iac-01/regions/australia-southeast2/subnetworks/ause2",
20:32:47.836 STDOUT terraform1.13.3:             ]
20:32:47.836 STDOUT terraform1.13.3:         }
20:32:47.836 STDOUT terraform1.13.3:     }
20:32:47.836 STDOUT terraform1.13.3: Plan: 2 to add, 0 to change, 0 to destroy.
20:32:47.836 STDOUT terraform1.13.3: 
20:32:47.836 STDOUT terraform1.13.3: Changes to Outputs:
20:32:47.836 STDOUT terraform1.13.3:   + ca_cert        = (sensitive value)
20:32:47.836 STDOUT terraform1.13.3:   + endpoints      = (known after apply)
20:32:47.836 STDOUT terraform1.13.3:   + id             = (known after apply)
20:32:47.836 STDOUT terraform1.13.3:   + valkey_cluster = {
20:32:47.837 STDOUT terraform1.13.3:       + authorization_mode                = "IAM_AUTH"
20:32:47.837 STDOUT terraform1.13.3:       + automated_backup_config           = []
20:32:47.837 STDOUT terraform1.13.3:       + available_maintenance_versions    = (known after apply)
20:32:47.837 STDOUT terraform1.13.3:       + backup_collection                 = (known after apply)
20:32:47.837 STDOUT terraform1.13.3:       + create_time                       = (known after apply)
20:32:47.837 STDOUT terraform1.13.3:       + cross_instance_replication_config = (known after apply)
20:32:47.838 STDOUT terraform1.13.3:       + deletion_protection_enabled       = false
20:32:47.838 STDOUT terraform1.13.3:       + desired_auto_created_endpoints    = []
20:32:47.838 STDOUT terraform1.13.3:       + desired_psc_auto_connections      = [
20:32:47.838 STDOUT terraform1.13.3:           + {
20:32:47.838 STDOUT terraform1.13.3:               + network    = "projects/iac-01/global/networks/stg-iac-01"
20:32:47.838 STDOUT terraform1.13.3:               + project_id = "iac-01"
20:32:47.839 STDOUT terraform1.13.3:             },
20:32:47.839 STDOUT terraform1.13.3:         ]
20:32:47.839 STDOUT terraform1.13.3:       + discovery_endpoints               = (known after apply)
20:32:47.839 STDOUT terraform1.13.3:       + effective_labels                  = {
20:32:47.839 STDOUT terraform1.13.3:           + component                  = "memorystore"
20:32:47.839 STDOUT terraform1.13.3:           + environment                = "stg"
20:32:47.839 STDOUT terraform1.13.3:           + goog-terraform-provisioned = "true"
20:32:47.839 STDOUT terraform1.13.3:           + managed_by                 = "atlantis"
20:32:47.839 STDOUT terraform1.13.3:           + org                        = "nz3es"
20:32:47.840 STDOUT terraform1.13.3:           + plane                      = "data-plane"
20:32:47.840 STDOUT terraform1.13.3:           + project                    = "iac-01"
20:32:47.840 STDOUT terraform1.13.3:           + region                     = "australia-southeast2"
20:32:47.840 STDOUT terraform1.13.3:         }
20:32:47.840 STDOUT terraform1.13.3:       + effective_maintenance_version     = (known after apply)
20:32:47.840 STDOUT terraform1.13.3:       + endpoints                         = (known after apply)
20:32:47.840 STDOUT terraform1.13.3:       + engine_configs                    = {
20:32:47.840 STDOUT terraform1.13.3:           + maxmemory-policy = "volatile-lru"
20:32:47.841 STDOUT terraform1.13.3:         }
20:32:47.841 STDOUT terraform1.13.3:       + engine_version                    = "VALKEY_8_0"
20:32:47.841 STDOUT terraform1.13.3:       + gcs_source                        = []
20:32:47.841 STDOUT terraform1.13.3:       + id                                = (known after apply)
20:32:47.841 STDOUT terraform1.13.3:       + instance_id                       = "volatile-lru"
20:32:47.841 STDOUT terraform1.13.3:       + kms_key                           = null
20:32:47.841 STDOUT terraform1.13.3:       + labels                            = {
20:32:47.841 STDOUT terraform1.13.3:           + component   = "memorystore"
20:32:47.841 STDOUT terraform1.13.3:           + environment = "stg"
20:32:47.842 STDOUT terraform1.13.3:           + managed_by  = "atlantis"
20:32:47.842 STDOUT terraform1.13.3:           + org         = "nz3es"
20:32:47.842 STDOUT terraform1.13.3:           + plane       = "data-plane"
20:32:47.842 STDOUT terraform1.13.3:           + project     = "iac-01"
20:32:47.842 STDOUT terraform1.13.3:           + region      = "australia-southeast2"
20:32:47.842 STDOUT terraform1.13.3:         }
20:32:47.842 STDOUT terraform1.13.3:       + location                          = "australia-southeast2"
20:32:47.843 STDOUT terraform1.13.3:       + maintenance_policy                = []
20:32:47.843 STDOUT terraform1.13.3:       + maintenance_schedule              = (known after apply)
20:32:47.843 STDOUT terraform1.13.3:       + maintenance_version               = null
20:32:47.843 STDOUT terraform1.13.3:       + managed_backup_source             = []
20:32:47.843 STDOUT terraform1.13.3:       + managed_server_ca                 = (known after apply)
20:32:47.843 STDOUT terraform1.13.3:       + mode                              = (known after apply)
20:32:47.843 STDOUT terraform1.13.3:       + name                              = (known after apply)
20:32:47.843 STDOUT terraform1.13.3:       + node_config                       = (known after apply)
20:32:47.844 STDOUT terraform1.13.3:       + node_type                         = "SHARED_CORE_NANO"
20:32:47.844 STDOUT terraform1.13.3:       + persistence_config                = [
20:32:47.844 STDOUT terraform1.13.3:           + {
20:32:47.844 STDOUT terraform1.13.3:               + aof_config = (known after apply)
20:32:47.844 STDOUT terraform1.13.3:               + mode       = (known after apply)
20:32:47.844 STDOUT terraform1.13.3:               + rdb_config = (known after apply)
20:32:47.844 STDOUT terraform1.13.3:             },
20:32:47.844 STDOUT terraform1.13.3:         ]
20:32:47.844 STDOUT terraform1.13.3:       + project                           = "iac-01"
20:32:47.845 STDOUT terraform1.13.3:       + psc_attachment_details            = (known after apply)
20:32:47.845 STDOUT terraform1.13.3:       + psc_auto_connections              = (known after apply)
20:32:47.845 STDOUT terraform1.13.3:       + replica_count                     = 0
20:32:47.845 STDOUT terraform1.13.3:       + shard_count                       = 1
20:32:47.845 STDOUT terraform1.13.3:       + state                             = (known after apply)
20:32:47.846 STDOUT terraform1.13.3:       + state_info                        = (known after apply)
20:32:47.846 STDOUT terraform1.13.3:       + terraform_labels                  = {
20:32:47.846 STDOUT terraform1.13.3:           + component                  = "memorystore"
20:32:47.846 STDOUT terraform1.13.3:           + environment                = "stg"
20:32:47.846 STDOUT terraform1.13.3:           + goog-terraform-provisioned = "true"
20:32:47.846 STDOUT terraform1.13.3:           + managed_by                 = "atlantis"
20:32:47.847 STDOUT terraform1.13.3:           + org                        = "nz3es"
20:32:47.847 STDOUT terraform1.13.3:           + plane                      = "data-plane"
20:32:47.847 STDOUT terraform1.13.3:           + project                    = "iac-01"
20:32:47.847 STDOUT terraform1.13.3:           + region                     = "australia-southeast2"
20:32:47.847 STDOUT terraform1.13.3:         }
20:32:47.847 STDOUT terraform1.13.3:       + timeouts                          = null
20:32:47.847 STDOUT terraform1.13.3:       + transit_encryption_mode           = "SERVER_AUTHENTICATION"
20:32:47.848 STDOUT terraform1.13.3:       + uid                               = (known after apply)
20:32:47.848 STDOUT terraform1.13.3:       + update_time                       = (known after apply)
20:32:47.848 STDOUT terraform1.13.3:       + zone_distribution_config          = [
20:32:47.848 STDOUT terraform1.13.3:           + {
20:32:47.848 STDOUT terraform1.13.3:               + mode = "MULTI_ZONE"
20:32:47.848 STDOUT terraform1.13.3:               + zone = null
20:32:47.848 STDOUT terraform1.13.3:             },
20:32:47.848 STDOUT terraform1.13.3:         ]
20:32:47.848 STDOUT terraform1.13.3:     }
20:32:47.848 STDOUT terraform1.13.3: ╷
20:32:47.848 STDOUT terraform1.13.3: │ Warning: Argument is deprecated
20:32:47.849 STDOUT terraform1.13.3: │ 
20:32:47.849 STDOUT terraform1.13.3: │   with module.valkey.google_memorystore_instance.valkey_cluster,
20:32:47.849 STDOUT terraform1.13.3: │   on .terraform/modules/valkey/modules/valkey/main.tf line 17, in resource "google_memorystore_instance" "valkey_cluster":
20:32:47.849 STDOUT terraform1.13.3: │   17: resource "google_memorystore_instance" "valkey_cluster" {
20:32:47.849 STDOUT terraform1.13.3: │ 
20:32:47.849 STDOUT terraform1.13.3: │ `desired_psc_auto_connections` is deprecated. Use
20:32:47.849 STDOUT terraform1.13.3: │ `desired_auto_created_endpoints` instead. `terraform import` will only work
20:32:47.849 STDOUT terraform1.13.3: │ with desired_auto_created_endpoints`.
20:32:47.850 STDOUT terraform1.13.3: ╵
20:32:47.850 STDOUT terraform1.13.3: ╷
20:32:47.850 STDOUT terraform1.13.3: │ Warning: Deprecated attribute
20:32:47.850 STDOUT terraform1.13.3: │ 
20:32:47.850 STDOUT terraform1.13.3: │   on .terraform/modules/valkey/modules/valkey/outputs.tf line 24, in output "discovery_endpoints":
20:32:47.850 STDOUT terraform1.13.3: │   24:   value       = google_memorystore_instance.valkey_cluster.discovery_endpoints
20:32:47.850 STDOUT terraform1.13.3: │ 
20:32:47.850 STDOUT terraform1.13.3: │ The attribute "discovery_endpoints" is deprecated. Refer to the provider
20:32:47.850 STDOUT terraform1.13.3: │ documentation for details.
20:32:47.850 STDOUT terraform1.13.3: │ 
20:32:47.850 STDOUT terraform1.13.3: │ (and one more similar warning elsewhere)
20:32:47.851 STDOUT terraform1.13.3: ╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/memorystore/volatile-lru -w nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_memorystore_volatile-lru
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://www.3es.nz/lock?id=esquare666%252Finfra-as-code%252Fnz3es%252Fgcp%252Fstg%252Fdata-plane%252Fiac-01%252Faustralia-southeast2%252Fmemorystore%252Fvolatile-lru%252Fnz3es_gcp_stg_data-plane_iac-01_australia-southeast2_memorystore_volatile-lru)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/memorystore/volatile-lru -w nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_memorystore_volatile-lru
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 4. dir: `nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/secret/volatile-lru-ca-cert` workspace: `nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_secret_volatile-lru-ca-cert`
<details><summary>Show Output</summary>

```diff
Removing TG cache from /home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_secret_volatile-lru-ca-cert...
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_secret_volatile-lru-ca-cert/modules/dns-zone/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_secret_volatile-lru-ca-cert/modules/dns-zone/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_secret_volatile-lru-ca-cert/modules/dns-zone/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_secret_volatile-lru-ca-cert/modules/memorystore-valkey/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_secret_volatile-lru-ca-cert/modules/memorystore-valkey/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_secret_volatile-lru-ca-cert/modules/memorystore-valkey/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_secret_volatile-lru-ca-cert/modules/secret-manager/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_secret_volatile-lru-ca-cert/modules/secret-manager/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_secret_volatile-lru-ca-cert/modules/secret-manager/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_secret_volatile-lru-ca-cert/modules/vpc/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_secret_volatile-lru-ca-cert/modules/vpc/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_secret_volatile-lru-ca-cert/modules/vpc/variables.tf

20:32:50.260 WARN   The following strict control(s) are already completed: skip-dependencies-inputs. Please remove any completed strict controls, as setting them no longer does anything. For a list of all ongoing strict controls, and the outcomes of previous strict controls, see https://terragrunt.gruntwork.io/docs/reference/strict-mode or get the actual list by running the `terragrunt info strict` command.
20:32:52.451 WARN   Config ../../memorystore/volatile-lru/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
20:32:52.456 INFO   Downloading Terraform configurations from ../../../../../../../../modules/secret-manager into ./.terragrunt-cache/5pMsVa6Jmyj5JfmmfOver3nFw08/7yGoAMcWftpshCLbF8vuxWjS8e4
20:32:52.500 INFO   terraform1.13.3: Initializing the backend...
20:32:53.228 INFO   terraform1.13.3: 
20:32:53.228 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
20:32:53.229 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
20:32:53.774 INFO   terraform1.13.3: Initializing provider plugins...
20:32:53.775 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 6.0.0"...
20:32:53.998 INFO   terraform1.13.3: - Using hashicorp/google v7.17.0 from the shared cache directory
20:32:54.343 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
20:32:54.343 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
20:32:54.343 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
20:32:54.343 INFO   terraform1.13.3: you run "terraform init" in the future.
20:32:54.343 INFO   terraform1.13.3: ╷
20:32:54.343 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
20:32:54.343 INFO   terraform1.13.3: │ 
20:32:54.343 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
20:32:54.344 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
20:32:54.344 INFO   terraform1.13.3: │   - hashicorp/google
20:32:54.344 INFO   terraform1.13.3: │ 
20:32:54.344 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
20:32:54.344 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
20:32:54.345 INFO   terraform1.13.3: │ these providers.
20:32:54.345 INFO   terraform1.13.3: │ 
20:32:54.345 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
20:32:54.345 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
20:32:54.345 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
20:32:54.345 INFO   terraform1.13.3: ╵
20:32:54.345 INFO   terraform1.13.3: Terraform has been successfully initialized!
20:32:57.289 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
20:32:57.289 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
20:32:57.289 STDOUT terraform1.13.3:   + create
20:32:57.290 STDOUT terraform1.13.3: Terraform will perform the following actions:
20:32:57.290 STDOUT terraform1.13.3:   # google_secret_manager_secret.secret will be created
20:32:57.290 STDOUT terraform1.13.3:   + resource "google_secret_manager_secret" "secret" {
20:32:57.290 STDOUT terraform1.13.3:       + create_time           = (known after apply)
20:32:57.290 STDOUT terraform1.13.3:       + deletion_protection   = false
20:32:57.290 STDOUT terraform1.13.3:       + effective_annotations = (known after apply)
20:32:57.290 STDOUT terraform1.13.3:       + effective_labels      = {
20:32:57.290 STDOUT terraform1.13.3:           + "component"                  = "secret"
20:32:57.290 STDOUT terraform1.13.3:           + "environment"                = "stg"
20:32:57.290 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
20:32:57.291 STDOUT terraform1.13.3:           + "managed_by"                 = "atlantis"
20:32:57.291 STDOUT terraform1.13.3:           + "org"                        = "nz3es"
20:32:57.291 STDOUT terraform1.13.3:           + "plane"                      = "data-plane"
20:32:57.291 STDOUT terraform1.13.3:           + "project"                    = "iac-01"
20:32:57.291 STDOUT terraform1.13.3:           + "region"                     = "australia-southeast2"
20:32:57.291 STDOUT terraform1.13.3:         }
20:32:57.291 STDOUT terraform1.13.3:       + expire_time           = (known after apply)
20:32:57.291 STDOUT terraform1.13.3:       + id                    = (known after apply)
20:32:57.291 STDOUT terraform1.13.3:       + labels                = {
20:32:57.291 STDOUT terraform1.13.3:           + "component"   = "secret"
20:32:57.291 STDOUT terraform1.13.3:           + "environment" = "stg"
20:32:57.292 STDOUT terraform1.13.3:           + "managed_by"  = "atlantis"
20:32:57.292 STDOUT terraform1.13.3:           + "org"         = "nz3es"
20:32:57.292 STDOUT terraform1.13.3:           + "plane"       = "data-plane"
20:32:57.292 STDOUT terraform1.13.3:           + "project"     = "iac-01"
20:32:57.292 STDOUT terraform1.13.3:           + "region"      = "australia-southeast2"
20:32:57.292 STDOUT terraform1.13.3:         }
20:32:57.292 STDOUT terraform1.13.3:       + name                  = (known after apply)
20:32:57.292 STDOUT terraform1.13.3:       + project               = "iac-01"
20:32:57.292 STDOUT terraform1.13.3:       + secret_id             = "volatile-lru-ca-cert"
20:32:57.292 STDOUT terraform1.13.3:       + terraform_labels      = {
20:32:57.293 STDOUT terraform1.13.3:           + "component"                  = "secret"
20:32:57.293 STDOUT terraform1.13.3:           + "environment"                = "stg"
20:32:57.293 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
20:32:57.293 STDOUT terraform1.13.3:           + "managed_by"                 = "atlantis"
20:32:57.293 STDOUT terraform1.13.3:           + "org"                        = "nz3es"
20:32:57.293 STDOUT terraform1.13.3:           + "plane"                      = "data-plane"
20:32:57.293 STDOUT terraform1.13.3:           + "project"                    = "iac-01"
20:32:57.293 STDOUT terraform1.13.3:           + "region"                     = "australia-southeast2"
20:32:57.293 STDOUT terraform1.13.3:         }
20:32:57.293 STDOUT terraform1.13.3:       + replication {
20:32:57.293 STDOUT terraform1.13.3:           + auto {
20:32:57.294 STDOUT terraform1.13.3:             }
20:32:57.294 STDOUT terraform1.13.3:         }
20:32:57.294 STDOUT terraform1.13.3:     }
20:32:57.294 STDOUT terraform1.13.3:   # google_secret_manager_secret_version.version will be created
20:32:57.294 STDOUT terraform1.13.3:   + resource "google_secret_manager_secret_version" "version" {
20:32:57.294 STDOUT terraform1.13.3:       + create_time            = (known after apply)
20:32:57.294 STDOUT terraform1.13.3:       + deletion_policy        = "DELETE"
20:32:57.294 STDOUT terraform1.13.3:       + destroy_time           = (known after apply)
20:32:57.294 STDOUT terraform1.13.3:       + enabled                = true
20:32:57.294 STDOUT terraform1.13.3:       + id                     = (known after apply)
20:32:57.294 STDOUT terraform1.13.3:       + name                   = (known after apply)
20:32:57.295 STDOUT terraform1.13.3:       + project                = (known after apply)
20:32:57.295 STDOUT terraform1.13.3:       + secret                 = (known after apply)
20:32:57.295 STDOUT terraform1.13.3:       + secret_data            = (sensitive value)
20:32:57.295 STDOUT terraform1.13.3:       + secret_data_wo         = (write-only attribute)
20:32:57.295 STDOUT terraform1.13.3:       + secret_data_wo_version = 0
20:32:57.295 STDOUT terraform1.13.3:       + version                = (known after apply)
20:32:57.295 STDOUT terraform1.13.3:     }
20:32:57.295 STDOUT terraform1.13.3: Plan: 2 to add, 0 to change, 0 to destroy.
20:32:57.295 STDOUT terraform1.13.3: 
20:32:57.295 STDOUT terraform1.13.3: Changes to Outputs:
20:32:57.295 STDOUT terraform1.13.3:   + secret_id   = "volatile-lru-ca-cert"
20:32:57.296 STDOUT terraform1.13.3:   + secret_name = (known after apply)
20:32:57.296 STDOUT terraform1.13.3:   + version     = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/secret/volatile-lru-ca-cert -w nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_secret_volatile-lru-ca-cert
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://www.3es.nz/lock?id=esquare666%252Finfra-as-code%252Fnz3es%252Fgcp%252Fstg%252Fdata-plane%252Fiac-01%252Faustralia-southeast2%252Fsecret%252Fvolatile-lru-ca-cert%252Fnz3es_gcp_stg_data-plane_iac-01_australia-southeast2_secret_volatile-lru-ca-cert)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/secret/volatile-lru-ca-cert -w nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_secret_volatile-lru-ca-cert
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 5. dir: `nz3es/gcp/stg/data-plane/iac-01/global/dns-zone/iac-internal` workspace: `nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-internal`
<details><summary>Show Output</summary>

```diff
Removing TG cache from /home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-internal...
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-internal/modules/dns-zone/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-internal/modules/dns-zone/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-internal/modules/dns-zone/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-internal/modules/memorystore-valkey/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-internal/modules/memorystore-valkey/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-internal/modules/memorystore-valkey/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-internal/modules/vpc/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-internal/modules/vpc/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-internal/modules/vpc/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-internal/modules/secret-manager/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-internal/modules/secret-manager/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/4/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-internal/modules/secret-manager/variables.tf

20:32:50.261 WARN   The following strict control(s) are already completed: skip-dependencies-inputs. Please remove any completed strict controls, as setting them no longer does anything. For a list of all ongoing strict controls, and the outcomes of previous strict controls, see https://terragrunt.gruntwork.io/docs/reference/strict-mode or get the actual list by running the `terragrunt info strict` command.
20:32:52.476 WARN   Config ../../../australia-southeast2/memorystore/volatile-lru/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
20:32:53.434 INFO   Downloading Terraform configurations from ../../../../../../../../modules/dns-zone into ./.terragrunt-cache/_LegMQYm8K6yMpap-6_OhvmATYQ/er78G-K5-AFpl0JOIzqP4gyOFRs
20:32:53.491 INFO   terraform1.13.3: Initializing the backend...
20:32:54.214 INFO   terraform1.13.3: 
20:32:54.214 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
20:32:54.214 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
20:32:54.503 INFO   terraform1.13.3: Initializing provider plugins...
20:32:54.504 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 6.0.0"...
20:32:54.699 INFO   terraform1.13.3: - Using hashicorp/google v7.17.0 from the shared cache directory
20:32:55.041 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
20:32:55.041 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
20:32:55.041 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
20:32:55.041 INFO   terraform1.13.3: you run "terraform init" in the future.
20:32:55.041 INFO   terraform1.13.3: ╷
20:32:55.041 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
20:32:55.042 INFO   terraform1.13.3: │ 
20:32:55.042 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
20:32:55.042 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
20:32:55.042 INFO   terraform1.13.3: │   - hashicorp/google
20:32:55.042 INFO   terraform1.13.3: │ 
20:32:55.042 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
20:32:55.042 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
20:32:55.042 INFO   terraform1.13.3: │ these providers.
20:32:55.043 INFO   terraform1.13.3: │ 
20:32:55.043 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
20:32:55.043 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
20:32:55.043 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
20:32:55.043 INFO   terraform1.13.3: ╵
20:32:55.043 INFO   terraform1.13.3: Terraform has been successfully initialized!
20:32:58.080 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
20:32:58.081 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
20:32:58.081 STDOUT terraform1.13.3:   + create
20:32:58.081 STDOUT terraform1.13.3: Terraform will perform the following actions:
20:32:58.081 STDOUT terraform1.13.3:   # google_dns_managed_zone.zone will be created
20:32:58.081 STDOUT terraform1.13.3:   + resource "google_dns_managed_zone" "zone" {
20:32:58.081 STDOUT terraform1.13.3:       + creation_time    = (known after apply)
20:32:58.081 STDOUT terraform1.13.3:       + description      = "Private DNS zone for stg"
20:32:58.082 STDOUT terraform1.13.3:       + dns_name         = "iac.internal."
20:32:58.082 STDOUT terraform1.13.3:       + effective_labels = {
20:32:58.082 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
20:32:58.082 STDOUT terraform1.13.3:         }
20:32:58.082 STDOUT terraform1.13.3:       + force_destroy    = false
20:32:58.082 STDOUT terraform1.13.3:       + id               = (known after apply)
20:32:58.082 STDOUT terraform1.13.3:       + managed_zone_id  = (known after apply)
20:32:58.082 STDOUT terraform1.13.3:       + name             = "iac-internal"
20:32:58.082 STDOUT terraform1.13.3:       + name_servers     = (known after apply)
20:32:58.083 STDOUT terraform1.13.3:       + project          = "iac-01"
20:32:58.083 STDOUT terraform1.13.3:       + terraform_labels = {
20:32:58.083 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
20:32:58.083 STDOUT terraform1.13.3:         }
20:32:58.083 STDOUT terraform1.13.3:       + visibility       = "private"
20:32:58.083 STDOUT terraform1.13.3:       + cloud_logging_config (known after apply)
20:32:58.083 STDOUT terraform1.13.3:       + dnssec_config (known after apply)
20:32:58.083 STDOUT terraform1.13.3:       + private_visibility_config {
20:32:58.083 STDOUT terraform1.13.3:           + networks {
20:32:58.084 STDOUT terraform1.13.3:               + network_url = "https://www.googleapis.com/compute/v1/projects/iac-01/global/networks/stg-iac-01"
20:32:58.084 STDOUT terraform1.13.3:             }
20:32:58.084 STDOUT terraform1.13.3:         }
20:32:58.084 STDOUT terraform1.13.3:     }
20:32:58.084 STDOUT terraform1.13.3:   # google_dns_record_set.records["app"] will be created
20:32:58.084 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
20:32:58.084 STDOUT terraform1.13.3:       + id           = (known after apply)
20:32:58.084 STDOUT terraform1.13.3:       + managed_zone = "iac-internal"
20:32:58.084 STDOUT terraform1.13.3:       + name         = "app.iac.internal."
20:32:58.085 STDOUT terraform1.13.3:       + project      = "iac-01"
20:32:58.085 STDOUT terraform1.13.3:       + rrdatas      = [
20:32:58.085 STDOUT terraform1.13.3:           + "10.1.0.10",
20:32:58.085 STDOUT terraform1.13.3:         ]
20:32:58.085 STDOUT terraform1.13.3:       + ttl          = 300
20:32:58.085 STDOUT terraform1.13.3:       + type         = "A"
20:32:58.085 STDOUT terraform1.13.3:     }
20:32:58.085 STDOUT terraform1.13.3:   # google_dns_record_set.records["db"] will be created
20:32:58.085 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
20:32:58.086 STDOUT terraform1.13.3:       + id           = (known after apply)
20:32:58.086 STDOUT terraform1.13.3:       + managed_zone = "iac-internal"
20:32:58.086 STDOUT terraform1.13.3:       + name         = "db.iac.internal."
20:32:58.086 STDOUT terraform1.13.3:       + project      = "iac-01"
20:32:58.086 STDOUT terraform1.13.3:       + rrdatas      = [
20:32:58.086 STDOUT terraform1.13.3:           + "10.1.0.20",
20:32:58.086 STDOUT terraform1.13.3:         ]
20:32:58.086 STDOUT terraform1.13.3:       + ttl          = 300
20:32:58.086 STDOUT terraform1.13.3:       + type         = "A"
20:32:58.086 STDOUT terraform1.13.3:     }
20:32:58.086 STDOUT terraform1.13.3:   # google_dns_record_set.records["volatile-lru"] will be created
20:32:58.087 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
20:32:58.087 STDOUT terraform1.13.3:       + id           = (known after apply)
20:32:58.087 STDOUT terraform1.13.3:       + managed_zone = "iac-internal"
20:32:58.087 STDOUT terraform1.13.3:       + name         = "volatile-lru.iac.internal."
20:32:58.087 STDOUT terraform1.13.3:       + project      = "iac-01"
20:32:58.087 STDOUT terraform1.13.3:       + rrdatas      = [
20:32:58.087 STDOUT terraform1.13.3:           + "10.0.0.1",
20:32:58.087 STDOUT terraform1.13.3:         ]
20:32:58.087 STDOUT terraform1.13.3:       + ttl          = 300
20:32:58.087 STDOUT terraform1.13.3:       + type         = "A"
20:32:58.088 STDOUT terraform1.13.3:     }
20:32:58.088 STDOUT terraform1.13.3: Plan: 4 to add, 0 to change, 0 to destroy.
20:32:58.088 STDOUT terraform1.13.3: 
20:32:58.088 STDOUT terraform1.13.3: Changes to Outputs:
20:32:58.088 STDOUT terraform1.13.3:   + dns_name     = "iac.internal."
20:32:58.088 STDOUT terraform1.13.3:   + name_servers = (known after apply)
20:32:58.088 STDOUT terraform1.13.3:   + zone_name    = "iac-internal"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d nz3es/gcp/stg/data-plane/iac-01/global/dns-zone/iac-internal -w nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-internal
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://www.3es.nz/lock?id=esquare666%252Finfra-as-code%252Fnz3es%252Fgcp%252Fstg%252Fdata-plane%252Fiac-01%252Fglobal%252Fdns-zone%252Fiac-internal%252Fnz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-internal)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d nz3es/gcp/stg/data-plane/iac-01/global/dns-zone/iac-internal -w nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-internal
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### Plan Summary

5 projects, 4 with changes, 1 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```